---
type: MechanicalFitting
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 1
tags: [revit-api, class]
---

# MechanicalFitting

`Autodesk.Revit.DB.Mechanical.MechanicalFitting` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | PartType | — | `public PartType PartType { get ; }` |